//--------подключние библиотек-----------------------------------------------------
#include "Chip_W5100.h"		//библиотека для управления чипом w5100
#include <avr/io.h>			//ввод-вывод данных

//--------настройка SPI-------------------------------------------------------------
void SPI_MASTER(void){
	DDRB|= (1<<MOSI)|(1<<SCK)|(1<<SS);				//настраиваем на вход
	SPCR|= (1<<SPE)|(1<<MSTR)|(1<<SPR0);			//инициализируем spi,выбираем режим мастер,частоту работы sck
													//порядок передачи данных MSB-first
}
//*********************************************************************************

//--------передача данных по SPI---------------------------------------------------
void SPI_WRITE(unsigned int addr,unsigned char Data){
	PORTB&= ~(1<<SS);					//линиия SS активна
	SPDR = WRITE_OPCODE;				//выбираем операцию записи
		while (!(SPSR & (1<<SPIF)));		//ожидаем завершение передачи данных
	SPDR = (addr & 0xFF00) >> 8;		//начало передачи старшего бита
		while (!(SPSR & (1<<SPIF)));
	SPDR = addr & 0x00FF;				//начало передачи младщего бита
		while (!(SPSR & (1<<SPIF)));
	SPDR = Data;						//передаем данные
		while (!(SPSR & (1<<SPIF)));
	PORTB|=	(1<<SS);					//линия SS неактивна
}//end SPI_WRITE
//**********************************************************************************

//--------прием данных--------------------------------------------------------------
unsigned char SPI_READ(unsigned int addr){
	PORTB&= ~(1<<SS);						//линия SS активна
	SPDR = READ_OPCODE;						//выбираем операцию чтения
		while (!(SPSR & (1<<SPIF)));		//ожидаем завершение приема данных
	SPDR = (addr & 0xFF00) >> 8;
		while (!(SPSR & (1<<SPIF)));
	SPDR = addr & 0x00FF;
		while (!(SPSR & (1<<SPIF)));
	SPDR = 0x00;							//отправляем какие-то данные для чтения
		while (!(SPSR & (1<<SPIF)));
	PORTB|=	(1<<SS);						//линия SS неактивна
	return SPDR;							//возвращем значение
}//end SPI_READ
//**********************************************************************************