//--------подключние библиотек-----------------------------------------------------
#include "Chip_W5100.h"
#include <avr/io.h>			//ввод/вывод данных

//--------настройка usart-----------------------------------------------------------
void USART_INIT(void){
UCSR0A=0x00;
UCSR0B=(1<<TXEN0)|(0<<UCSZ02);      //разрещаем передачу данных по usart
UCSR0C=(0<<UMSEL01)|(0<<UMSEL00)|(0<<UPM01)|(0<<UPM00)|(0<<USBS0)|(1<<UCSZ01)|(1<<UCSZ00); //настройка пакета передачи
UBRR0H=0x00;			//настройка скорости передачи,старший бит
UBRR0L=103;				//младший бит
}
//**********************************************************************************

//-------передача данных по USART---------------------------------------------------
void USART_Transmitt(unsigned char value){
	while(!(UCSR0A &(1<<UDRE0)));
	UDR0= value;
}
//**********************************************************************************

//--------функция передачи строки по USART------------------------------------------
void USART_STRING(char *string){
	while(*string != '\0'){
		USART_Transmitt(*string);
		string++;
	}
}
//**********************************************************************************

//--------преобразование значений для USART-----------------------------------------
void CONVERT(int n){
	int s = 1;
	for(int temp=n/10; temp>0; temp/=10)s*=10;
	for(; s>0; s/=10)USART_Transmitt(0x30+(n/s)%10);
}
//**********************************************************************************
